# Cps Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Cps Property
SymbolTypeId Class See Also
---
Symbol cps, indicating unit Cycles per second.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Cps { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Cps As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Cps {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace